<a href="https://colab.research.google.com/github/bnimmer/hello-world/blob/master/Working_file_ex_02_03_pandas_begin.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Python statistics essential training - 02_03_pandas

Standard imports

In [0]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp

%matplotlib inline

In [5]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

The above method works in principal, but raised errors with data parsing when used on the same file as with the method described below.

In [0]:
planets = pd.read_csv('test_planets.csv')

In [15]:
planets

,Planet,Mass,Diameter,DayLength,SunDistance,OrbitPeriod,OrbitVelocity,MeanTemperature,SurfacePressure,Moons,Rings,MagneticField,FirstVisited,FirstMission
0,MERCURY,0.3300,4879,4222.6,57.9,88,47.4,167,0.00000,0,No,Yes,1974-03-29,Mariner 10
1,VENUS,4.8700,"12,104",2802.0,108.2,224.7,35.0,464,92.00000,0,No,No,1962-08-27,Mariner 2
2,EARTH,5.9700,"12,756",24.0,149.6,365.2,29.8,15,1.00000,1,No,Yes,NaN,NaN
3,MOON,0.0730,3475,708.7,NaN,27.3,1.0,-20,0.00000,0,No,No,1959-09-12,Luna 2
4,MARS,0.6420,6792,24.7,227.9,687,24.1,-65,0.01000,2,No,No,1965-07-15,Mariner 4
5,JUPITER,1898.0000,"142,984",9.9,778.6,4331,13.1,-110,NaN,67,Yes,Yes,1973-12-04,Pioneer 10
6,SATURN,568.0000,"120,536",10.7,1433.5,"10,747",9.7,-140,NaN,62,Yes,Yes,1979-09-01,Pioneer 11
7,URANUS,86.8000,"51,118",17.2,2872.5,"30,589",6.8,-195,NaN,27,Yes,Yes,1986-01-24,Voyager 2
8,NEPTUNE,102.0000,"49,528",16.1,4495.1,"59,800",5.4,-200,NaN,14,Yes,Yes,1989-08-25,Voyager 2
9,PLUTO,0.0146,2370,153.3,5906.4,"90,560",4.7,-225,0.00001,5,No,NaN,2015-07-14,New Horizons

Upload data to the instance of Jupiter notebook that is running. It is stored in the "content folder".
To re-run the notebook, the content has to be re-loaded after the instance was killed. (end of session.)

---

In [0]:
planets = pd.read_csv('test_planets.csv',usecols=(0,1,2,3))

In [19]:
planets

    Planet       Mass Diameter  DayLength
0  MERCURY     0.3300     4879     4222.6
1    VENUS     4.8700   12,104     2802.0
2    EARTH     5.9700   12,756       24.0
3     MOON     0.0730     3475      708.7
4     MARS     0.6420     6792       24.7
5  JUPITER  1898.0000  142,984        9.9
6   SATURN   568.0000  120,536       10.7
7   URANUS    86.8000   51,118       17.2
8  NEPTUNE   102.0000   49,528       16.1
9    PLUTO     0.0146     2370      153.3

Here we use "usecols=(0,1,2,..)" to reduce the dataset to the columns specified. NOTE: the columns are defined by index => starting at 0.

In [21]:
planets['Mass']

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

Show just one column and define it by Column name

In [25]:
planets.Mass

0       0.3300
1       4.8700
2       5.9700
3       0.0730
4       0.6420
5    1898.0000
6     568.0000
7      86.8000
8     102.0000
9       0.0146
Name: Mass, dtype: float64

This is the dot notation to show a column => same result as the above method of calling planets ['Mass']

In [27]:
planets.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
planets.loc[0]

Planet       MERCURY
Mass            0.33
Diameter        4879
DayLength     4222.6
Name: 0, dtype: object

To show a particular row, as per index use the dot notation with the loc[x] method.

In [0]:
planets.set_index('Planet',inplace=True)

This method allows us to set an index based on a column name (Planet in this case)
The 'inplace=True' will set it to be permanent for all following operations. Typically, changes are made on a copy of the dataset in memory.
inplace=True makes it permanent.

In [36]:
planets.index

Index(['MERCURY', 'VENUS', 'EARTH', 'MOON', 'MARS', 'JUPITER', 'SATURN',
       'URANUS', 'NEPTUNE', 'PLUTO'],
      dtype='object', name='Planet')

In [0]:
planets = pd.read_csv('test_planets.csv')

In [0]:
planets.set_index('Planet',inplace=True)

Two lines above, I reloaded the original file with all the columns, loosing the index by doing so. I re-set the index to "Planets" column in the line above.

In [44]:
pd.to_datetime(planets.FirstVisited)

Planet
MERCURY   1974-03-29
VENUS     1962-08-27
EARTH            NaT
MOON      1959-09-12
MARS      1965-07-15
JUPITER   1973-12-04
SATURN    1979-09-01
URANUS    1986-01-24
NEPTUNE   1989-08-25
PLUTO     2015-07-14
Name: FirstVisited, dtype: datetime64[ns]

In [47]:
planets.loc['EARTH'].FirstVisited

nan

Case **matters** on the variables.

In [0]:
planets.FirstVisited=pd.to_datetime(planets.FirstVisited)

In [49]:
planets.FirstVisited.dt.year

Planet
MERCURY    1974.0
VENUS      1962.0
EARTH         NaN
MOON       1959.0
MARS       1965.0
JUPITER    1973.0
SATURN     1979.0
URANUS     1986.0
NEPTUNE    1989.0
PLUTO      2015.0
Name: FirstVisited, dtype: float64

With the "pd.to_datetime" method I changed the string values of the column FirstVisited to a float value. This allows for other operations on these values.

In [50]:
2019-planets.FirstVisited.dt.year

Planet
MERCURY    45.0
VENUS      57.0
EARTH       NaN
MOON       60.0
MARS       54.0
JUPITER    46.0
SATURN     40.0
URANUS     33.0
NEPTUNE    30.0
PLUTO       4.0
Name: FirstVisited, dtype: float64

With the conversion to float values, the above calculaton is possible.
Current year (2019) minus the year the planet was visited first gives us the years since the first visit.

For functions and methods in Panda, use the [Pandas documentation](https://https://pandas.pydata.org/pandas-docs/stable/) or search with your questions on [stackoverflow.](https://https://stackoverflow.com/)